---
kind: method
id: M:Autodesk.Revit.DB.UnitUtils.GetAllMeasurableSpecs
source: html/3acc20f9-40cd-d2d0-cb84-6b47d2140a14.htm
---
# Autodesk.Revit.DB.UnitUtils.GetAllMeasurableSpecs Method

Gets the identifiers of all available measurable specs.

## Syntax (C#)
```csharp
public static IList<ForgeTypeId> GetAllMeasurableSpecs()
```

## Returns
The spec identifiers.